// Даны переменные test1 и test2. Проверьте, что значение какой из этих переменных больше и выведите соответствующее сообщение на экран.
// let test1 = 10;
// let test2 = 20;
// if (test1 > test2) {
//     console.log(test1);
// } else if (test1 < test2) {
//     console.log(test2);
// } else {
//     console.log("Значения равны");
// }

// Если переменная num1 равна или меньше 1, а переменная num2 больше или равна 3, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.
// let num1 = -5;
// let num2 = 5;
// if (num1 <= 1 && num2 >= 3) {
//     console.log('верно');
// }else {console.log('неверно')}


// let num1 = 2;
// let num2 = 6;
// if (!(num1 >= 0 || num2 <= 10)) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
// let day = 15;
// if (day <= 10) {
//     console.log("в первую");
// } else if (day >= 21) {
//     console.log("третью");
// } else {console.log("вторую")}

// Пусть в переменной num хранится число. Если это число не попадает в диапазон от 10 до 99, то выведите на экран сообщение об этом. Если же число попадает в указанный диапазон, то найдите сумму цифр этого числа. Если полученная сумма меньше или равна 9, то выведите на экран сообщение о том, что сумма цифр однозначна, в противном случае выведите сообщение о том, что сумма цифр двузначна.
// let num = 56;
// if (num<10 || num >99){
// alert ('Число не попадает в указанный диапазон');
// }
// else {
// let num2 = num%10;
// let num1 = (num-num2)/10;
// let result = num1 + num2;
// if(result<=9)
// alert('Сумма цифр однозначная');
// else alert('Сумма цифр двузначная');
// }

